Podkova/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <attributes>
    <name>ВариантЗаполненияДекларации</name>
    <type>
      <types>EnumRef.ВариантыЗаполненияДекларацииИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантФормированияАТКИСМП</name>
    <type>
      <types>EnumRef.ВариантыФормированияАТКИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДекларации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИмпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеМаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.ИдентификаторЗаявкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроисхожденияВЕТИССтрокой</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияНанесения</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводственнойЛинии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоеРешение</name>
    <type>
      <types>EnumRef.ПринятыеРешенияИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкоропортящаясяПродукцияВЕТИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаСертификации</name>
      <comment>Вид документа обязательной сертификации</comment>
      <type>
        <types>EnumRef.ВидыДокументовОбязательнойСертификацииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокументаСертификации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокументаСертификации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводства</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДекларации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПроисхожденияВЕТИС</name>
      <type>
        <types>DefinedType.ИдентификаторПроисхожденияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидМаркировки</name>
      <type>
        <types>EnumRef.УдалитьВидыМаркировкиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПроисхожденияВЕТИС</name>
      <type>
        <types>DefinedType.ИдентификаторПроисхожденияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеОтчетаПроизводственнойЛинии</name>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкодаУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыАТК</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/CommonModules/ИнтеграцияИСМППовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Проверяет доступность объекта метаданных. Проверки выполняются по:
// - доступности вида продукции;
// - функциональным опциям;
// 
// Параметры:
// 	ПолноеИмяМетаданных - Строка - полное имя проверяемого объекта метаданных.
// Возвращаемое значение:
// 	Булево - Признак доступности объекта.
Функция ОбъектМетаданныхДоступен(ПолноеИмяМетаданных) Экспорт
	
	ОбъектМетаданных         = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	ВозвращаемоеЗначение     = Ложь;
	НедоступныеВидыПродукции = Новый Массив();
	
	Если ОбъектМетаданных = Метаданные.Документы.ПеремаркировкаТоваровИСМП Тогда
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.Табак);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.АльтернативныйТабак);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС);
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ОтгрузкаТоваровИСМП Тогда
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.Табак);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.АльтернативныйТабак);
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ПриемкаТоваровИСМП Тогда
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.Табак);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.АльтернативныйТабак);
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ВозвратВОборотИСМП Тогда
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.Табак);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.АльтернативныйТабак);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС);
		НедоступныеВидыПродукции.Добавить(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС);
	КонецЕсли;
	
	Если НедоступныеВидыПродукции.Количество() Тогда
		
		ВидыПродукции = Новый Массив();
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыПродукции, ИнтеграцияИСКлиентСервер.ВидыПродукцииИСМП(Истина));
		
		ПроверяемыеВидыПродукции = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВидыПродукции, НедоступныеВидыПродукции);
		
		Для Каждого ВидПродукции Из ПроверяемыеВидыПродукции Цикл
			
			Если ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции(ВидПродукции) Тогда
				ВозвращаемоеЗначение = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	
	Иначе
		ВозвращаемоеЗначение = Истина;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТаблицаПолейДанныйДляРасшифровкиОшибок() Экспорт
	
	ТаблицаДанных = ИнтеграцияИС.ПустаяТаблицаПредставленийПолей();
	
	ПространствоИмен = Метаданные.ПакетыXDTO.ТипыМОТП.ПространствоИмен;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "Индекс";
	НоваяСтрока.Представление    = НСтр("ru = 'Индекс'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "КодСтр";
	НоваяСтрока.Представление    = НСтр("ru = 'Код страны'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "АдрТекст";
	НоваяСтрока.Представление    = НСтр("ru = 'Адрес'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "ПричинаВыбытия";
	НоваяСтрока.Представление    = НСтр("ru = 'Причина выбытия'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "Дата";
	НоваяСтрока.Представление    = НСтр("ru = 'Дата'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "Время";
	НоваяСтрока.Представление    = НСтр("ru = 'Время'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "Наименование";
	НоваяСтрока.Представление    = НСтр("ru = 'Наименование первичного документа'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "Номер";
	НоваяСтрока.Представление    = НСтр("ru = 'Номер'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "КодРегион";
	НоваяСтрока.Представление    = НСтр("ru = 'Код региона'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "ИННФЛТип";
	НоваяСтрока.Представление    = НСтр("ru = 'ИНН физического лица'");
	НоваяСтрока.Обязательное     = Истина;
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ПространствоИмен = ПространствоИмен;
	НоваяСтрока.ЛокальноеИмя     = "ИННЮЛТип";
	НоваяСтрока.Представление    = НСтр("ru = 'ИНН юридического лица'");
	НоваяСтрока.Обязательное     = Истина;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ТекстЗапросаПоискаДокументаПоИдентификаторуЗаявки() Экспорт
	
	ТекстыЗапроса = Новый Массив();
	ШаблонЗапроса = "
	|ВЫБРАТЬ
	|	ДокументИСМП.Ссылка                КАК Ссылка,
	|	Представление(ДокументИСМП.Ссылка) КАК Представление,
	|	ДокументИСМП.Проведен              КАК Проведен,
	|	ДокументИСМП.ИдентификаторЗаявки   КАК ИдентификаторЗаявки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП КАК ДокументИСМП
	|ГДЕ
	|	ДокументИСМП.ИдентификаторЗаявки В (&ИдентификаторыДокументов)";
	
	Для Каждого ЭлементПодсистемы Из Метаданные.Подсистемы.ГосИС.Подсистемы.ИСМП.Состав Цикл
		
		Если ОбщегоНазначения.ЭтоДокумент(ЭлементПодсистемы) Тогда
			ТекстыЗапроса.Добавить(
				СтрЗаменить(
					ШаблонЗапроса,
					"Документ.МаркировкаТоваровИСМП",
					СтрШаблон("Документ.%1", ЭлементПодсистемы.Имя)));
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса =  СтрСоединить(
		ТекстыЗапроса,
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|");
	
	ТекстЗапроса = СтрШаблон(
		"%1
		|УПОРЯДОЧИТЬ ПО
		|	Проведен",
		ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
